<template>
  <div>
    <TheHeader />
    <FloatBtn v-on:openDialog="dialog = true" />
    <TheDialog v-on:closeDialog="dialog = false" v-if="dialog" />
    <div class="flex bg-black container">
      <div class="p-4 rounded shadow-lg">
        <div class="items-center space-y-2">
          <h1 class="text-4xl font-bold text-header">صفحة سياسة الخصوصية</h1>
          <p class="text-white">
            في موقع (جولدن كولاجين)، ندرك أن خصوصية معلوماتك الشخصية هامة لك ولنا. فيما
            يلي معلومات حول أنواع المعلومات الشخصية التي نتلقاها ونقوم بجمعها عند زيارات
            (جولدن كولاجين)، وكيف نقوم بحماية معلوماتك الشخصية.
          </p>
          <h2 class="text-2xl font-bold text-header">ملفات السجل</h2>
          <p class="text-white">
            كما هو الحال مع معظم مواقع الويب المختلفة، نقوم بجمع واستخدام البيانات
            الموجودة في ملفات السجل. تشمل المعلومات الموجودة في ملفات السجل عنوان بروتوكول
            الإنترنت (IP) الخاص بك، ومزود خدمة الإنترنت (ISP)، والمتصفح الذي استخدمته
            لزيارة موقعنا، والوقت الذي قمت فيه بالزيارة، والصفحات التي قمت بزيارتها عبر
            موقعنا
          </p>
          <h2 class="text-2xl font-bold text-header">ملفات تعريف الارتباط</h2>
          <p class="text-white">
            تعد ملفات تعريف الارتباط الأساسية ضرورية لك للتنقل والتنقل في جميع أنحاء
            الموقع، ولا تخزن أي معلومات يمكن استخدامها لأغراض الدعاية، بدون ملفات تعريف
            الارتباط الأساسية، لن يعمل موقعنا بشكل صحيح.
          </p>
          <h2 class="text-2xl font-bold text-header">ملفات تعريف الارتباط المخصصة</h2>
          <p class="text-white">
            تخزن ملفات تعريف الارتباط هذه المعلومات ، مثل تفضيلاتك الشخصية ، وتستخدمها
            لتخصيص تجربة فريدة لك. قد يشمل ذلك عرض نافذة منبثقة مرة واحدة فقط في زيارتك ،
            أو حفظ تفضيلات اللغة الخاصة بك ، أو السماح لك بتسجيل الدخول تلقائيًا إلى بعض
            ميزاتنا.
          </p>
          <h2 class="text-2xl font-bold text-header">
            ملفات تعريف الارتباط في Analytics
          </h2>
          <p class="text-white">
            تلتقط ملفات تعريف الارتباط من Analytics بيانات مجهولة المصدر حتى نتمكن من رؤية
            الاتجاهات وتحسين تجربة موقعنا على الويب. هذه تتيح لنا اختبار تصميمات مختلفة ،
            وتساعدنا على تحديد الكسر إذا كان جزء من موقعنا لا يعمل
          </p>
          <h2 class="text-2xl font-bold text-header">ملفات تعريف الارتباط للإعلانات</h2>
          <p class="text-white">
            قد يستخدم بعض المعلنين من الجهات الخارجية ملفات تعريف الارتباط أو إشارات الويب
            عند الإعلان على موقعنا. سيقوم هؤلاء بإرسال معلومات إلى هؤلاء المعلنين (مثل
            Google من خلال برنامج Google AdSense) بما في ذلك عنوان IP الخاص بك ، ومزود
            خدمة الإنترنت ، والمتصفح الذي استخدمته لزيارة موقعنا ، وفي بعض الحالات معلومات
            حول ما إذا كنت قد قمت بتثبيت Flash.
          </p>
          <p class="text-white">
            سيقوم هؤلاء بإرسال معلومات إلى هؤلاء المعلنين (مثل Google من خلال برنامج
            Google AdSense) بما في ذلك عنوان IP الخاص بك ، ومزود خدمة الإنترنت ، والمتصفح
            الذي استخدمته لزيارة موقعنا ، وفي بعض الحالات معلومات حول ما إذا كنت قد قمت
            بتثبيت Flash.
          </p>
          <ul class="text-white">
            <li>
              يستخدم موردو الجهات الخارجية، بمن فيهم Google، ملفات تعريف ارتباط لعرض
              الإعلانات بناءً على زيارات المستخدم السابقة لموقعنا الإلكتروني أو لمواقع
              أخرى على الويب.
            </li>
            <li>
              ستتمكّن Google وشركاؤها، باستخدام ملفات تعريف الارتباط للإعلانات، من عرض
              الإعلانات للمستخدمين لديك استنادًا إلى زياراتهم لموقعنا و/أو مواقع أخرى عبر
              الإنترنت.
            </li>
            <li>
              يمكن للمستخدمين تعطيل استخدام الإعلانات المخصصة عن طريق الانتقال إلى إعدادات
              الإعلانات.
            </li>
          </ul>
          <p class="text-white">
            إذا لم يتم اختيار تعطيل عرض إعلانات الأطراف الثالثة، فقد يتم استخدام ملفات
            تعريف ارتباط موردي أو شبكات إعلانات الأطراف الثالثة الأخرى أيضًا لعرض
            الإعلانات في موقعنا.
          </p>
          <p class="text-white">
            يستخدم هذا بشكل عام لأغراض الاستهداف الجغرافي على سبيل المثال (عرض الإعلانات
            SEO في مصر لشخص ما في مصر) أو عرض إعلانات معينة بناءً على مواقع محددة تمت
            زيارتها (مثل عرض إعلانات العقارات لشخص يرتاد مواقع العقارات).
          </p>
          <p class="text-white">
            من خلال الاستمرار في استخدام موقعنا ، فإنك توافق على وضع ملفات تعريف الارتباط
            على جهازك، يمكنك اختيار تعطيل أو إيقاف تشغيل ملفات تعريف الارتباط أو ملفات
            تعريف ارتباط الطرف الثالث بشكل انتقائي في إعدادات المتصفح الخاص بك. ومع ذلك ،
            يمكن أن يؤثر هذا على كيفية تفاعلك مع موقعنا وكذلك مع مواقع الويب الأخرى.
          </p>
          <p class="text-white">
            اذا كان لديك اى سؤال او كان هنا اى مشكلة فى سياسة أستخدام البيانات الخاصة بنا
            الرجاء المراسلة ع من خلال الضغط على
            <button class="bg-header clickable" @click="dialog = true">اتصل بنا</button>.
          </p>
        </div>
      </div>
    </div>
    <TheFooter />
  </div>
</template>
<script>
export default {
  components: {
    TheHeader: () =>
      import(/* webpackChunkName: 'TheHeader' */ "~/components/TheHeader.vue"),
    TheFooter: () =>
      import(/* webpackChunkName: 'TheFooter' */ "~/components/TheFooter.vue"),
    TheDialog: () =>
      import(/* webpackChunkName: 'TheDialog' */ "~/components/TheDialog.vue"),
    FloatBtn: () =>
      import(/* webpackChunkName: 'FloatBtn' */ "~/components/FloatBtn.vue"),
  },
  data: () => ({
    dialog: false,
  }),
  head: {
    title: "سياسة الخصوصية - جولدن كولاجين",
    meta: [
      { charset: "utf-8" },
      { name: "viewport", content: "width=device-width, initial-scale=1" },
      {
        hid: "description",
        name: "description",
        content: "سياسة الخصوصية - جولدن كولاجين",
      },
    ],
    link: [{ rel: "icon", type: "image/x-icon", href: "/favicon.ico" }],
  },
};
</script>
