<template>
  <div>
    <TheHeader />
    <FloatBtn v-on:openDialog="dialog = true" />
    <TheDialog v-on:closeDialog="dialog = false" v-if="dialog" />
    <div class="flex bg-black container">
      <div class="p-4 rounded shadow-lg">
        <div class="items-center space-y-2">
          <h1 class="text-4xl font-bold text-header">صفحة سياسة الشحن والإسترجاع</h1>
          <h2 class="text-3xl font-bold text-header">الشحن المحلي:</h2>
          <h3 class="text-2xl font-bold text-header">خدمات الشحن:</h3>
          <ul class="text-white">
            <li>
              - تقتصر خدمة شحن وصلي والمقدمة من موقع جولدن كولاجين مباشرة على توصيل
              منتجاتنا لأي عنوان داخل مدينة المملكه فقط حالياً (ولا يشمل الشحن خارج البلاد
              )
            </li>
            <li>شركات الشحن الحالية سمسا إكسبريس أو ناقل أو زاجل فيتشر:</li>
            <p class="text-white">
              أما بالنسبة للطلبات التي سيتم شحنها من خلال طرف ثالث مثل SMSA او Naqel أو
              Fetchr فستقوم شركة الشحن بالتواصل مع العميل في خلال 48 إلى 72 ساعة عمل (في
              المتوسط) لتنسيق التسليم والتأكد من العنوان وموعد التسليم.
            </p>
            <p class="text-white">
              ولأفضل تسليم سنقوم بطلب معلومات عن المنطقة والحي والشارع والبناية والوحدة
              السكنية , كما قد نطلب إرسال رقم هاتف ثابت والموقع على خرائط جوجل Google Maps
              لتسهيل التوصيل ولتجنب الأخطاء.
            </p>
            <p class="text-white">
              كما يفضل توفير جوال بديل في حالة قام مندوب شركة الشحن بالإتصال ولم يرد
              العميل.
            </p>
            <li>
              يتم التسليم خلال فترة من 2 (يومين) إلى 5 (خمسة أيام عمل) على أقصى تقدير من
              تاريخ تسلم طلبك داخل المملكة.
            </li>
            <li>
              رسوم التوصيل 30 ريال سعودي لطلبات الشراء التي تقل قيمتها عن 300 ريال سعودي
              داخل المملكة العربية السعودية.
            </li>
            <li>
              في حالة وجود خطأ في العنوان أو بيانات التواصل أو عدم وضوح عنوان العميل لسبب
              ما أو وجود العميل خارج النطاق العمراني أو الطرق الممهدة فقد تقوم شركة الشحن
              بالتواصل مع العميل لإستلام المنتجات من أقرب مكتب توزيع أو مستودع متاح لمكان
              العميل.
            </li>
            <li>
              كما قد تطلب شركات الشحن من العميل في حالة إستعجاله على الإستلام أوعدم الرغبه
              في إنتظارمندوب شركة الشحن أن يتوجه إلى أقرب فرع أو مستودع للإستلام.
            </li>
          </ul>
          <h2 class="text-3xl font-bold text-header">الشحن الدولي:</h2>
          <p class="text-white">
            الشحن إلى خارج المملكة العربية السعودية سيتوقف على أسعار شركة الشحن و وزن
            الطلبية والدولة والوقت
          </p>
          <p class="text-white">
            وسنعمل على إظهار قيمة تقريبية لمبلغ الشحن قبل إنهاء عملية الشراء ولكن قد تتغير
            هذه القيمة جسب المتغيرات المذكورة أعلاه وبالتالي فسيكون من حق موقع جولدن
            كولاجين تكمال أو إلغاء شحن الطلبية وسيتم إفادة العميل في كل الأحوال بالإجراء
            الذي سيتم إتخاذه.
          </p>
          <h2 class="text-3xl font-bold text-header">تتبع الشحنات:</h2>
          <p class="text-white">
            عندما يتم شحن طلبك ستصلك رسالة نصية أو سيتم الإتصال أو ستصلك رسالة بالبريد
            الإلكتروني حسب سياسة شركة الشحن , وغالبا ما يكون هناك رابط إلكتروني لتحديد
            مكان وموعد الإستلام المناسب للعميل.
          </p>
          <p class="text-white">
            ولتتبع طلبك إضغط على الرابط أو زر موقع شركة الشحن ثم ضع رقم التتبع في مكان
            البحث المخصص على الموقع الإلكتروني لشركة الشحن وستحصل على جدول زمني كامل ومفصل
            لحركة الشحنة حتى لحظة إستلامك لها وتوقيعك على الإستلام.
          </p>
          <h2 class="text-3xl font-bold text-header">الشحن المجاني:</h2>
          <p class="text-white">
            الشحن مجاناً لجميع طلبات الشراء البالغة قيمتها 300 ريال سعودي فأكثر داخل
            المملكة العربية السعودية.
          </p>

          <h2 class="text-3xl font-bold text-header">
            سياسة الإلغاء و الاستبدال والإرجاع
          </h2>
          <p class="text-white">
            في البداية نؤكد أننا سنسعى جاهدين في موقع جولدن كولاجين للوفاء بمتطلبات
            عملائنا الكرام وتقديم أفضل مالدينا.
          </p>
          <h3 class="text-2xl font-bold text-header">أولاً: الإلغاء</h3>
          <p class="text-white">
            ندرك تماماً أنه في بعض الأحيان قد تغير رأيك بخصوص الشراء أو قد تطرأ لك بعد
            الظروف التي لاتسمح لك باستلام الطلبية وهناك في هذه الحالة إحتمالان:
          </p>
          <ul class="text-white">
            <li>
              الحالة الأولى: أن تقرر الإلغاء قبل خروج الطلبية من مستودعات شركة كدون مع
              مناديب التوصيل.
            </li>
            <p class="text-white">
              الإجراء المطلوب للإلغاء: كل ماعليك هو الإتصال بخدمة العملاء وتزويدهم ببيانات
              الطلب وتأكيد رغبتك في الإلغاء وسيقوم مسئول خدمة العملاء بذلك في الحال.
            </p>
            <li>الحالة الثانية: أن تقرر الإلغاء بعد خروج الطلبية مع شركات الشحن.</li>
            <p class="text-white">
              الإجراء المطلوب للإلغاء: في هذه الحالة سيتم معاملة الطلب على أنه مرتجع,
              فيرجى الإشاره إلى الجزأ الخاص بالإرجاع أدناه. وفي في كل الأحوال كل ماعليك هو
              الإتصال بخدمة العملاء وتزويدهم ببيانات الطلب وتأكيد رغبتك في الإلغاء وسيقوم
              مسئول خدمة العملاء بالتواصل مع شركات الشحن المعنية وطلب الإلغاء.
            </p>
          </ul>
          <h3 class="text-2xl font-bold text-header">ثانيا مقترح للدراسة:</h3>
          <p class="text-white">
            عند الإلغاء بدون مبرر مقنع أو سبب خارج عن إرادة العميل فإن موقع جولدن
            كولاجينسيكون قد تكبد في هذه الحالة تكلفة شحن + تكلفة إرجاع , وفي هذه الحالة قد
            يتم خصم تكلفة الشحن "كحد أدنى" من المبلغ الذي تم تحصيله في حالة الدفع بالفيزا
            أو سداد أو التحويل البنكي أما إذا كانت الطلبية دفع عند التسليم , و حتى لا
            يتحمل موقع جولدن كولاجينالتكلفة مرتين فسيتم الطلب من العميل عند إعادة الطلب من
            موقع جولدن كولاجينأن تكون طريقة الدفع هي (فيزا أو سداد أو تحويل بنكي), وعند
            تكرار الإلغاء أو الإرجاع أكثر من مره و بدون سبب مقنع فإن من حق إدارة موقع
            جولدن كولاجينأن تقوم بحظر هذا العميل وإضافته إلى قائمة العملاء المحظورين.
          </p>
          <h2 class="text-3xl font-bold text-header">الإرجاع أو الإستبدال:</h2>
          <p class="text-white">
            نظراً لأن منتجاتنا كلها منتجات تجميل ومستحضرات عناية شخصية كما أنها شديدة
            الحساسية للشمس أو الحرارة الزائدة وبمجرد خروجها من المتجر (حيث التخزين الجيد
            والتبريد والتهوية المثاليين) وبالرغم من أننا نشترط على شركات الشحن العناية
            بمنتجاتنا أثناء الشحن فإننا لا نضمن ما يحدث لتلك المنتجات أثناء الشحن للعميل
            ولذلك ننصح بالتاكد من سلامة المنتجات قبل مغادرة مندوب شركة الشحن وإلا فقد
            يتعذر الإسترجاع ثانية من العميل بعد مغادرة المندوب لصعوبة إثبات أن ما طرأ على
            المنتج كان بسبب شركة الشحن او أثناء عملية الشحن والتوصيل.
          </p>
          <p class="text-white">
            وعليه فإن سياسة موقع جولدن كولاجين تقوم على تقنين وتنظيم عملية إسترداد القيمة
            المالية لتكون متاحة فقط في حالة إستحالة تعويض العميل بوسائل التعويض الأخرى
            والتأكد من أن العيب أو الخلل أو التقصير وقع من طرف موقع جولدن كولاجين
            لإلكتروني فقط، وبرغم ذلك يمكن بحث امكانية إجراء استبدال لأي منتج تم شراؤه من
            موقع جولدن كولاجين شرط أن لا يتم فتح العبوة وأن تعيده إلينا خلال مدة لا تتجاوز
            7 (سبعة أيام) من تاريخ الإستلام، وذلك إلى مقر مستودعات موقع جولدن
          </p>
          <p class="text-white">
            ويشترط أن تكون جميع الطلبات مرفقة بنسخة (سواء إلكترونية أو مطبوعة) من أصل
            الإيصال المرفق مع المنتج على أن يكون المنتج في علبته كما هي دون فتحها وأن يكون
            في حالة صالحة للبيع.
          </p>
          <p class="text-white">
            كما يرجى ملاحظة أن الشركة لا تسمح بأي إرجاع أو استبدال في حالة فتح عبوة أي
            منتج أو استخدامه فجميع منتجاتنا خاضعة لمراقبة الجودة ويتم فحصها للتحقق من أي
            عيوب قبل إرسالها إليك عميلنا الكريم.
          </p>
          <p class="text-white">
            في حالة إستلام طلبية من أحد شركات الشحن أو مناديب التوصيل وكانت في حالة غير
            مناسبة للإستلام لكسر أو تسرب للمنتج أو أي سبب أخر , على العميل إن يوثق حالة
            المنتج قدر المستطاع قبل الإستلام حتى يتسنى لنا التحري في الأمر مع شركات الشحن.
          </p>
          <h3 class="text-2xl font-bold text-header">تعريف المنتج المعيب:</h3>
          <p class="text-white">
            تصنف المنتجات على أنها معيبة في حالة تسلمها وهي تالفة أو في حالة إكتشاف عيب
            صناعة خفي تحدده كدون خلال فترة 14 يوم من تاريخ الشراء بحد أقصى. ويرجى كذلك
            ملاحظة أن المنتجات التي تتلف نتيجة لعوامل معينة متعلقة بالتخزين أو بالاستعمال
            أو الإهمال أو سوء الاستخدام أو الصيانة غير السليمة أو أي سبب آخر ينسب للعميل،
            لا تعتبر معيبة ولا يمكن استرجاعها أو استبدالها.
          </p>
          <ul class="text-white">
            <li>
              اولا استبدال المنتج: - أو إصلاحه، إذا كان هذا الخيار متاحاً للمنتج المعيب؛ -
              أو استرداد قيمة المنتج المعيب بالكامل.
            </li>
            <li>
              ثانياً: إرسال المنتج إلى مستودعات موقع جولدن كولاجين , بأحد الطرق التي سيتم
              تنسيقها مع خدمة العملاء, وبمجرد الإستلام سيتم تقييم الضرر والعيوب الموجوده
              بالمنتج وبالتالي تقييم التعويض المطلوب ومن ثم تعويض العميل إذا كان مستحقاً
              له.
            </li>
          </ul>
          <p class="text-white">
            ويتم استرداد قيمة المنتج المعيب بطريقة الدفع التي استلم بها المبلغ. وفي حالة
            سداد الدفعة الأولية ببطاقة ائتمان، يعاد الرصيد المخصوم إلى بطاقة الائتمان في
            غضون 14 (أربعة عشر) يوماً إلى 21 يوماً.
          </p>
        </div>
      </div>
    </div>
    <TheFooter />
  </div>
</template>
<script>
export default {
  components: {
    TheHeader: () =>
      import(/* webpackChunkName: 'TheHeader' */ "~/components/TheHeader.vue"),
    TheFooter: () =>
      import(/* webpackChunkName: 'TheFooter' */ "~/components/TheFooter.vue"),
    TheDialog: () =>
      import(/* webpackChunkName: 'TheDialog' */ "~/components/TheDialog.vue"),
    FloatBtn: () =>
      import(/* webpackChunkName: 'FloatBtn' */ "~/components/FloatBtn.vue"),
  },
  data: () => ({
    dialog: false,
  }),
  head: {
    title: "سياسة الشحن والاسترجاع - جولدن كولاجين",
    meta: [
      { charset: "utf-8" },
      { name: "viewport", content: "width=device-width, initial-scale=1" },
      {
        hid: "description",
        name: "description",
        content: "سياسة الشحن والاسترجاع - جولدن كولاجين",
      },
    ],
    link: [{ rel: "icon", type: "image/x-icon", href: "/favicon.ico" }],
  },
};
</script>
