<template>
  <div>
    <TheHeader />
    <FloatBtn v-on:openDialog="dialog = true" />
    <TheDialog v-on:closeDialog="dialog = false" v-if="dialog" />
    <div class="flex bg-black container">
      <div class="p-4 rounded shadow-lg">
        <div class="items-center space-y-2">
          <h1 class="text-4xl font-bold text-header">الشروط والاحكام</h1>
          <h2 class="text-3xl font-bold text-header">المقدّمة:</h2>
          
          <p class="text-white">
            www.goldencollagen.com  ، تنطبق هذه الشروط والأحكام على كل الأنشطة والتعاملات التي تتم من خلال المتجر الإلكتروني أو التطبيقات التابعه له وتعتبر كمرجعٍ آمنٍ للمتجر وتعاملاته.
          </p>

          <h2 class="text-2xl font-bold text-header">تنبيه:</h2>
          <p class="text-white">
            يعتبر استخدامك لموقع جولدن كولاجين أو احد التطبيقات التابعه له والاستفادة من خدماته التي يقدمها موافقة مسبقة ومطلقة منك على كافة الشروط والأحكام الواردة أدناه واقرار  بإطلاعك على هذه البنود والأحكام وموافقتك عليها دون أي تحفظ لأي سبب كان.
          </p>
          <h2 class="text-2xl font-bold text-header">الهدف:</h2>
          <p class="text-white">
            يعتبر الهدف الرئيس من قائمة الشروط والأحكام هذه هو الحفاظ على ورعاية حقوق وتطلعات العملاء مع مراعاة رعاية مصالح ملاك المتجر الإلكتروني وتجنب الأخطاء قدر المستطاع , إنطلاقاً من قاعدة "لاضرر وضرار".
          </p>
          <p class="text-white">ونؤكد لعميلتنا الكريمة وعميلنا الكريم أنكم بؤرة إهتمامنا وسنسعى جاهدين لخدمتكم ورعاية مصالحكم وبذل الجهد لتكون تجربة التصفح و الشراء والمشاركة على موقع جولدن كولاجينالإلكتروني هي تجربة ممتعة ذات طابع جمالي يليق بكم وبذوقكم الراقي.</p>
          <h2 class="text-2xl font-bold text-header">العمر:</h2>
          <p class="text-white">
            عميلتنا الكريمة / عملينا الكريم، للاستفادة من خدمات هذا الموقع يجب أن تبلغ من العمر ثمانية عشر عامًا أو تزور هذا الموقع تحت إشراف أحد الوالدين أو الوصي القانوني حتى يتسنى لك التمتع بمنتجات وخدمات المتجر على الوجه الأفضل.
          </p>
          <h2 class="text-2xl font-bold text-header">
            طلبات شراء المنتجات:
          </h2>
          <p class="text-white">
            موقع جولدن كولاجين يقدم المنتجات والخدمات حسب حالة توفرها , فإذا تعذر على المتجر لأي سبب خارج نطاق إرادتنا توفير صنف معين أو خدمة معينة فسنبلغك عميلنا الكريم بذلك في أسرع وقت ممكن كما سنلتزم برد أو إعادة المبلغ الذي دفعته أو الذي خصم من بطاقتك نظير قيمة المنتج أو الخدمة، ما لم تكن لديك الرغبة في قبول منتجات أخرى بديلة بجودة وسعر مماثلين.
          </p>
          <p class="text-white">
            كما يحتفظ موقع جولدن كولاجين بالحق في الاعتذار عن أو رفض أي طلب شراء أو إلغائه لأي سببٍ كان بما في ذلك القيود المفروضة على الكميات المتاحة للشراء أو لوجود أخطاء في معلومات السعر أو المنتج أو الخدمة أو بسبب المعلومات غير الدقيقة أو أي مشكلة أخرى نكتشفها من شأنها الإضرار بمصالح موقع جولدن كولاجين أو العميل.
          </p>
          <p class="text-white">
            كما يؤكد موقع جولدن كولاجين أن منتجاتنا ليست مخصصة لإعادة البيع أو للعرض سواء بوسائل البيع التقليدي أو من خلال وسائل التواصل  الاجتماعي والتجارة الإلكترونية, ولا يحق للعميل البيع بإسم أو نيابة عن موقع جولدن كولاجينأو إنتحال شخصية مندوب أو موزع للمتجر من دون الحصول على موافقة رسمية من إدارة موقع جولدن كولاجينتسمح له إعادة بيع وترويج المنتجات تحت إشراف ومتابعة موقع جولدن كولاجينوأن يتم ذلك بعد إضافة وتعريف الشخص الذي يرغب في البيع أو التسويق على نظام حلفاء التسويق الخاص بموقع جولدن كولاجينAffiliate System ويخضع لفترة تجربة وتقييم مدتها 3 أشهر يحق لموقع جولدن كولاجين خلالها تقييم التجربة وإكمال التعاقد أو إنهائه او تعديله.
          </p>
          <p class="text-white">
            وبتأكيدك على طلب الشراء في ختام إجراءات الشراء، توافق على قبول ودفع كامل المبلغ المستحق نظير قيمة المنتج/الخدمة على النحو المشار إليه في أثناء تسجيل طلب الشراء، بما يشمل أي تكاليف شحن أو رسوم تفرض مع طلب الشراء، ويعتبر البيع نافذ وملزم.
          </p>
          <p class="text-white">
            في حالة طلبات الشراء من موقع جولدن كولاجينالإلكتروني والدفع عند الإستلام فإذا امتنع العميل لأي سبب غير مبرر من عيب أو خطأ بالمنتج عن الدفع لمندوب التسليم والتحصيل فإن للمتجر الحق في عدم تسليم المنتج أو إتخاذ كافة الإجراءات القانونية التي تحفظ حق المتجر وتتفادى تلاعب بعض العملاء .
          </p>
          <p class="text-white">
            في حالة وجود عروض تشمل خدمات تجميل أو خدمات علاجية أو دورات تدريبية أو غيرها من العروض فسيتم التنسيق بين خدمة عملاء موقع جولدن كولاجينوالوحدات المعنية لتنسيق المواعيد ومتطلبات الخدمة. كما ننوه أنه على العميلة التعاون مع خدمة العملاء في الإستجابة للمواعيد التي تم جدولتها حيث لن يتسنى تعويض الخدمة في حالة فقدان الموعد.
          </p>

          <h2 class="text-2xl font-bold text-header">
            الأسعار وسياسة الدفع:
          </h2>
          <p class="text-white">
            سعر المنتجات ورسوم التوصيل بالريال السعودي.
          </p>
          <h2 class="text-2xl font-bold text-header">
            ونقبل طرق الدفع التالية:
          </h2>
          <ul class="text-white">
            <li>بطاقات الائتمان: فيزا و ماستر كارد</li>
            <li>الدفع الآمن من خلال خدمة سداد</li>
            <li>الدفع من خلال تحويل لمصرف الراجحي او بنك الرياض</li>
            <li>والدفع عند الاستلام وبالريال السعودي.</li>
          </ul>
          <p class="text-white">
            وتخضع كل عمليات الدفع ببطاقات الائتمان لإثبات صحتها من جهة الإصدار , فإذا رفضت جهة الإصدار السماح بالدفع، فسنلغي طلب الشراء وسنتصل بك للتوصل إلى طريقة بديلة للدفع.
          </p>
          <p class="text-white">
            ويتعين أن تكون التفاصيل الواردة في بطاقة الائتمان الخاصة بك المستخدمة للدفع مطابقة تماماً لمعلومات الهوية الخاصة بصاحب البطاقة.
          </p>
          <p class="text-white">
            ولا يتم تخزين أو بيع أو مشاركة أو إيجار أو تأجير جميع تفاصيل بطاقات الائتمان لأي جهة خارجية.
          </p>
        </div>
      </div>
    </div>
    <TheFooter />
  </div>
</template>
<script>
export default {
  components: {
    TheHeader: () =>
      import(/* webpackChunkName: 'TheHeader' */ "~/components/TheHeader.vue"),
    TheFooter: () =>
      import(/* webpackChunkName: 'TheFooter' */ "~/components/TheFooter.vue"),
    TheDialog: () =>
      import(/* webpackChunkName: 'TheDialog' */ "~/components/TheDialog.vue"),
    FloatBtn: () =>
      import(/* webpackChunkName: 'FloatBtn' */ "~/components/FloatBtn.vue"),
  },
  data: () => ({
    dialog: false,
  }),
  head: {
    title: "الشروط والاحكام - جولدن كولاجين",
    meta: [
      { charset: "utf-8" },
      { name: "viewport", content: "width=device-width, initial-scale=1" },
      {
        hid: "description",
        name: "description",
        content: "الشروط والاحكام - جولدن كولاجين",
      },
    ],
    link: [{ rel: "icon", type: "image/x-icon", href: "/favicon.ico" }],
  },
};
</script>
